# if box==1 
#     print(" 2")

# box=1
# while box ==1:
#     print ("1")

# i=0
# while True:
#     if i == 13:
#         break
#     print(f'circle i = {i}')
#     i+=1
#     break   


# 
 
# num = [1,2,3,4,5,-10,3,4,5]    
# i=0
# while i<len (num):
#     if num [i]<0:
#         print ('Число { num[i]}' ) 
#         break
#         i+=1
        


# i = 0
# count = 0
# while i >0:
# if i % 3 ==0:
# count += 1
# i+=1

# i = 20      
# while i!=0:
#     print(i)
#     i-=2
    
    
#Домашнее задание #1: 
# Найти сумму чисел от 1 до 100 и вывести результат в консоль.

# a=1
# i=1
# while i<=100:
#     i+=1
#     a=(a+(a+1))
#     continue   
# print (a)

#Домашнее задание #2:
# Вывести на экран все четные значения от 1 до 100.
# while i<=100 and i%2==0: - не заработало, пришлось писать через IF :(

# i=1
# while i<=100:
#     if i % 2 ==0:
#         print (i)
#     i+=1


#Домашнее задание №3
# Вывести на экран все нечетные значения от 1 до 300.   
    
i=1
while i<=300:
    if i % 2>0:
        print (i)
    i+=1   
    

    
